Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр БронированиеНомеров
	Движения.БронированиеНомеров.Записывать = Истина;
	Движение = Движения.БронированиеНомеров.Добавить();
	Движение.Период = Дата;
	Движение.Номер = Бронь.БронируемыйНомер;
	Движение.ДатаНачала = Бронь.ДатаЗаезда;
	Движение.ДатаКонца = Бронь.ДатаВыезда; 
	Движение.Гость = Бронь.ОсновнойГость;
	Движение.СтатусБрони = Перечисления.СтатусБронирования.Отменено;
	Движение.ДатаОтменаБрони = Дата;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры