Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Проверка на число гостей
    Движения.БронированиеНомеров.Записывать = Истина;
    Движения.Записать();

		
	Если КоличествоГостей > БронируемыйНомер.МаксимальноеКоличествоГостей Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(
		    "Указано гостей: %1, максимум для номера: %2. Выберите другой номер.",
		    КоличествоГостей,
		    БронируемыйНомер.МаксимальноеКоличествоГостей
		);
		Сообщение.Поле = "КоличествоГостей";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	БронированиеНомеровСрезПоследних.ДатаКонца КАК ДатаКонца,
		|	БронированиеНомеровСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	БронированиеНомеровСрезПоследних.Номер КАК Номер,
		|	БронированиеНомеровСрезПоследних.СтатусБрони
		|ИЗ
		|	РегистрСведений.БронированиеНомеров.СрезПоследних(&Дата, ДатаКонца > &ДатаНач
		|	И ДатаНачала < &ДатаКон
		|	И Номер = &Номер) КАК БронированиеНомеровСрезПоследних";
		

		
		Запрос.УстановитьПараметр("Номер", БронируемыйНомер);
		Запрос.УстановитьПараметр("ДатаНач", ДатаЗаезда);
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ДатаКон", ДатаВыезда);
		
		//Запрос.УстановитьПараметр("ДатаКонца", ДатаВыезда);
		
		Результат = Запрос.Выполнить();
		ВыборкаНомер = Результат.Выбрать();
		ВыборкаНомер.Следующий();
		Если Не Результат.Пустой() и ВыборкаНомер.СтатусБрони <> Перечисления.СтатусБронирования.Отменено Тогда
		    Сообщение = Новый СообщениеПользователю;
		    Сообщение.Текст = СтрШаблон(
		        "Номер %1 занят с %2 по %3. Выберите другие даты или номер.",
		        ВыборкаНомер.Номер,
		        Формат(ВыборкаНомер.ДатаНачала, "ДФ=dd.MM.yyyy"),
		        Формат(ВыборкаНомер.ДатаКонца, "ДФ=dd.MM.yyyy")
		    );
		    Сообщение.Поле = "БронируемыйНомер";
		    Сообщение.Сообщить();
		    Отказ = Истина;
		КонецЕсли;
		
		Если не Отказ Тогда				
			// регистр БронированиеНомеров
			Движения.БронированиеНомеров.Записывать = Истина;
			Движение = Движения.БронированиеНомеров.Добавить();
			Движение.Период = Дата;
			Движение.Номер = БронируемыйНомер;
			Движение.ДатаНачала =ДатаЗаезда;
			Движение.ДатаКонца = ДатаВыезда;
			Движение.Гость = ОсновнойГость;
			Движение.СтатусБрони = СтатусБронирования;
		КонецЕсли;
КонецПроцедуры
