Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	Если КоличествоГостей > БронируемыйНомер.МаксимальноеКоличествоГостей Тогда
		Сообщить("Необходимо выбрать другой номер! Гостей больше, чем макс. кол-во гостей номера!");
		Отказ = Истина;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	БронированиеНомеровСрезПоследних.ДатаКонца КАК ДатаКонца,
		|	БронированиеНомеровСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	БронированиеНомеровСрезПоследних.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.БронированиеНомеров.СрезПоследних КАК БронированиеНомеровСрезПоследних
		|ГДЕ
		|	БронированиеНомеровСрезПоследних.Номер = &Номер
		|	И БронированиеНомеровСрезПоследних.ДатаНачала <= &ДатаНачала";
		
		Если ДатаЗаезда <= ДатаВыезда Тогда
			Сообщить("тест");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Номер", Номер);
		Запрос.УстановитьПараметр("ДатаНачала", ДатаЗаезда);
		//Запрос.УстановитьПараметр("ДатаКонца", ДатаВыезда);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Сообщить("Необходимо выбрать другие даты брони для номера!");
			Отказ = Истина;
		КонецЕсли;
						
		// регистр БронированиеНомеров
		Движения.БронированиеНомеров.Записывать = Истина;
		Движение = Движения.БронированиеНомеров.Добавить();
		Движение.Период = Дата;
		Движение.Номер = БронируемыйНомер;
		Движение.ДатаНачала =ДатаЗаезда;
		Движение.ДатаКонца = ДатаВыезда;
	КонецЕсли;
КонецПроцедуры
