Процедура ОбработкаПроведения(Отказ, Режим)
    
    // Считаем общую сумму зарплаты
    ИтогоЗарплата = 0;
    Для Каждого Строка Из Сотрудники Цикл
        ИтогоЗарплата = ИтогоЗарплата + Строка.Сумма;
    КонецЦикла;
    
    // Записываем в регистр доходов/расходов
    Движение = Движения.ДоходыРасходы.Добавить();
    Движение.Период = Дата;
    Движение.ТипСтатьи = Справочники.Статьи.РасходыНаОплатуТруда;
    Движение.Сумма = ИтогоЗарплата;
    
    Движения.ДоходыРасходы.Записывать = Истина;
    
КонецПроцедуры