
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	
	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, СсылкаНаДокумент)
	
	Макет = Документы.РазмещениеГостей.ПолучитьМакет("ФормаРегистрацииГостей");
	
	ОбластьНазвание = Макет.ПолучитьОбласть("Название");
	ОбластьОсновнаяИнформация = Макет.ПолучитьОбласть("ОсновнаяИнформация");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
	
	// Название
	ТабДок.Вывести(ОбластьНазвание);
	
	// Основная информация	
	ОбластьОсновнаяИнформация.Параметры.НомерБрони = СсылкаНаДокумент.Номер;
	ОбластьОсновнаяИнформация.Параметры.ДатаИВремя = СсылкаНаДокумент.Дата;
	ОбластьОсновнаяИнформация.Параметры.ФИО = СсылкаНаДокумент.ОсновнойГость.Наименование;
	//ОбластьОсновнаяИнформация.Параметры.ДатаРождения = ; // Не храним
	ОбластьОсновнаяИнформация.Параметры.ВидДокумента = СсылкаНаДокумент.ОсновнойГость.ВидДокумента;
	ОбластьОсновнаяИнформация.Параметры.ДатаВыдачи = Формат(СсылкаНаДокумент.ОсновнойГость.ДатаВыдачи, "ДЛФ=Д");
	ОбластьОсновнаяИнформация.Параметры.КемВыдан = СсылкаНаДокумент.ОсновнойГость.КемВыдан;
	//ОбластьОсновнаяИнформация.Параметры.Адрес = ;
	//ОбластьОсновнаяИнформация.Параметры.Профессия = ; 
	//ОбластьОсновнаяИнформация.Параметры.Гражданство = ;
	ОбластьОсновнаяИнформация.Параметры.Телефон = СсылкаНаДокумент.ОсновнойГость.Телефон;
	//ОбластьОсновнаяИнформация.Параметры.ЭлектроннаяПочта = ;
	ОбластьОсновнаяИнформация.Параметры.ДатаЗаезда = Формат(СсылкаНаДокумент.ДатаЗаезда, "ДЛФ=Д");
	ОбластьОсновнаяИнформация.Параметры.ДатаВыезда = Формат(СсылкаНаДокумент.ДатаВыезда, "ДЛФ=Д");
	ОбластьОсновнаяИнформация.Параметры.НомерНомера = СсылкаНаДокумент.Бронь.БронируемыйНомер.Номер;
	//ОбластьОсновнаяИнформация.Параметры.Условия = ; // не знаю, что это
	//ОбластьОсновнаяИнформация.Параметры.КоличествоПредыдущихЗаездов = ; // как считать?
	
	ТабДок.Вывести(ОбластьОсновнаяИнформация);
	
	// Шапка Таблицы	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	// Строки таблицы
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РазмещениеГостейСписокГостей.НомерСтроки,
		|	РазмещениеГостейСписокГостей.Гость
		|ИЗ
		|	Документ.РазмещениеГостей.СписокГостей КАК РазмещениеГостейСписокГостей
		|ГДЕ
		|	РазмещениеГостейСписокГостей.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьСтрокаТаблицы.Параметры.НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
		ОбластьСтрокаТаблицы.Параметры.ФамилияГостя = ВыборкаДетальныеЗаписи.Гость.Фамилия;
		ОбластьСтрокаТаблицы.Параметры.ИмяГостя = ВыборкаДетальныеЗаписи.Гость.Имя;
		ОбластьСтрокаТаблицы.Параметры.ОтчествоГостя = ВыборкаДетальныеЗаписи.Гость.Отчество;
		//ОбластьСтрокаТаблицы.Параметры.ДатаРожденияГостя = ;
		ОбластьСтрокаТаблицы.Параметры.НомерПаспортаГостя = ВыборкаДетальныеЗаписи.Гость.СерияНомер;
		//ОбластьСтрокаТаблицы.Параметры.ПолГостя = ;
		
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
	// Подпись	
	ТабДок.Вывести(ОбластьПодпись);

КонецПроцедуры