
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);
	
	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, СсылкаНаДокумент)
	
	Макет = Документы.РазмещениеГостей.ПолучитьМакет("ФормаРегистрацииГостей");
	
	ОбластьНазвание = Макет.ПолучитьОбласть("Название");
	ОбластьОсновнаяИнформация = Макет.ПолучитьОбласть("ОсновнаяИнформация");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
	
	ТабДок.Вывести(ОбластьНазвание);
	ТабДок.Вывести(ОбластьОсновнаяИнформация);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.Вывести(ОбластьСтрокаТаблицы);
	ТабДок.Вывести(ОбластьПодпись);

КонецПроцедуры