
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    ЗаполнитьУслугиНаСервере();
КонецПроцедуры
&НаКлиенте
Процедура ГостьПриИзменении(Элемент)
    ЗаполнитьУслугиНаСервере();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьУслугиНаСервере()

    Если НЕ ЗначениеЗаполнено(Объект.Гость) Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	БронированиеНомераУслуги.Услуга КАК Услуга,
    |	БронированиеНомераУслуги.Количество КАК Количество,
    |	БронированиеНомераУслуги.Цена КАК Цена,
    |	БронированиеНомераУслуги.Сумма КАК Сумма,
    |	БронированиеНомераУслуги.Ссылка КАК Бронь
    |ИЗ
    |	Документ.БронированиеНомера.Услуги КАК БронированиеНомераУслуги
    |ГДЕ
    |	БронированиеНомераУслуги.Ссылка.ОсновнойГость = &Гость
    |	И БронированиеНомераУслуги.Ссылка.Проведен
    |	И БронированиеНомераУслуги.Ссылка.ДатаЗаезда <= &Дата
    |	И БронированиеНомераУслуги.Ссылка.ДатаВыезда >= &Дата";

    Запрос.УстановитьПараметр("Гость", Объект.Гость);
    Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
    
    Результат = Запрос.Выполнить();

    Если Результат.Пустой() Тогда
        Сообщить("Услуги не найдены на эту дату");
        Возврат;
    КонецЕсли;

    Объект.Услуги.Загрузить(Результат.Выгрузить());

КонецПроцедуры