

&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаЗаезда) и ЗначениеЗаполнено(Объект.ДатаВыезда) Тогда
		РазностьДат = Объект.ДатаВыезда - Объект.ДатаЗаезда;
		Продолжительность = Макс(РазностьДат, 0)/86400;
		Объект.ПродолжительностьПребывания = Продолжительность;
	Иначе
		Объект.ПродолжительностьПребывания = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоГостейПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.БронируемыйНомер) Тогда;
		Возврат;
	КонецЕсли;

	Если Объект.КоличествоГостей > ПолучитьМаксимальноеКоличествоГостейНомера(Объект.БронируемыйНомер) Тогда
		Сообщить("Необходимо выбрать другой номер! Госте больше, чем макс. кол-во гостей номера!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БронируемыйНомерПриИзменении(Элемент)
	
	// Сбросим цену при очистке номера
	Если Объект.БронируемыйНомер = Неопределено Тогда
		Объект.Цена = 0;
		Возврат;
	КонецЕсли;
	Номер = Объект.БронируемыйНомер;
	Цена = ПолучитьАктуальнуюСтоимостьНомера(Номер);
	Объект.Цена = Цена;
	Если Объект.КоличествоГостей > ПолучитьМаксимальноеКоличествоГостейНомера(Объект.БронируемыйНомер) Тогда
		Сообщить("Необходимо выбрать другой номер! Госте больше, чем макс. кол-во гостей номера!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальнуюСтоимостьНомера(Номер)
	Дата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьНомеровСрезПоследних.Стоимость КАК Стоимость,
	|	СтоимостьНомеровСрезПоследних.МаксимальноеКоличествоГостей КАК МаксимальноеКоличествоГостей
	|ИЗ
	|	РегистрСведений.СтоимостьНомеров.СрезПоследних КАК СтоимостьНомеровСрезПоследних
	|ГДЕ
	|	СтоимостьНомеровСрезПоследних.ТипНомера = &ТипНомера
	|	И СтоимостьНомеровСрезПоследних.МаксимальноеКоличествоГостей = &МаксимальноеКоличествоГостей";
	
	Запрос.УстановитьПараметр("ТипНомера", Номер.ТипНомера);
	Запрос.УстановитьПараметр("МаксимальноеКоличествоГостей", Номер.МаксимальноеКоличествоГостей);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Стоимость = Выборка.Стоимость;	
	Возврат Стоимость;
КонецФункции

&НаСервере
Функция ПолучитьМаксимальноеКоличествоГостейНомера(Номер)
	Возврат Номер.МаксимальноеКоличествоГостей;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии()    
    Элементы.ПродолжительностьПребывания.Доступность = Ложь;
    Элементы.ДатаВыезда.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)    
    Элементы.ПродолжительностьПребывания.Доступность = ЗначениеЗаполнено(Объект.ДатаЗаезда);
    Элементы.ДатаВыезда.Доступность = ЗначениеЗаполнено(Объект.ДатаЗаезда);
КонецПроцедуры