
Процедура ПроверкаПродолжительности()
	Если ЗначениеЗаполнено(Объект.ДатаЗаезда) и ЗначениеЗаполнено(Объект.ДатаВыезда) Тогда	
		Если Объект.ДатаВыезда <= Объект.ДатаЗаезда Тогда
        
	        Сообщение = Новый СообщениеПользователю;
	        Сообщение.Текст = "Дата выезда должна быть позже даты заезда";
	        Сообщение.Поле = "Объект.ДатаВыезда";
	        Сообщение.Сообщить();
	        Объект.ДатаВыезда = Неопределено;  // сбросить некорректное значение
	        	Возврат;
		КонецЕсли;
		РазностьДат = Объект.ДатаВыезда - Объект.ДатаЗаезда;
		Продолжительность = Макс(РазностьДат, 0)/86400;
		Объект.ПродолжительностьПребывания = Продолжительность;
	Иначе
		Объект.ПродолжительностьПребывания = 0;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
	ПроверкаПродолжительности()
КонецПроцедуры

&НаКлиенте
Процедура БронируемыйНомерПриИзменении(Элемент)
	
	// Сбросим цену при очистке номера
	Если Объект.БронируемыйНомер = Неопределено Тогда
		Объект.Цена = 0;
		Возврат;
	КонецЕсли;
	Номер = Объект.БронируемыйНомер;
	Цена = ПолучитьАктуальнуюСтоимостьНомера(Номер);
	Объект.Цена = Цена;
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальнуюСтоимостьНомера(Номер)
	Дата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьНомеровСрезПоследних.Стоимость КАК Стоимость,
	|	СтоимостьНомеровСрезПоследних.МаксимальноеКоличествоГостей КАК МаксимальноеКоличествоГостей
	|ИЗ
	|	РегистрСведений.СтоимостьНомеров.СрезПоследних КАК СтоимостьНомеровСрезПоследних
	|ГДЕ
	|	СтоимостьНомеровСрезПоследних.ТипНомера = &ТипНомера
	|	И СтоимостьНомеровСрезПоследних.МаксимальноеКоличествоГостей = &МаксимальноеКоличествоГостей";
	
	Запрос.УстановитьПараметр("ТипНомера", Номер.ТипНомера);
	Запрос.УстановитьПараметр("МаксимальноеКоличествоГостей", Номер.МаксимальноеКоличествоГостей);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Стоимость = Выборка.Стоимость;	
	Возврат Стоимость;
КонецФункции


//&НаКлиенте
//Процедура ПриОткрытии()    
 //   Элементы.ПродолжительностьПребывания.Доступность = Ложь;
 //   Элементы.ДатаВыезда.Доступность = Ложь;
// КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)    
	ПроверкаПродолжительности()
КонецПроцедуры