&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
    
    ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
    
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
    
    ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
    
КонецПроцедуры
&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
    
    
    ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Услуга) Тогда
        Возврат;
    КонецЕсли;
    
    
    // Вызываем сервер для получения цены
    Цена = ПолучитьЦенуУслуги(ТекущаяСтрока.Услуга, Объект.Дата);
    
    
    ТекущаяСтрока.Цена = Цена;
    
    // Пересчитываем сумму
    Если ТекущаяСтрока.Количество > 0 Тогда
        ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуУслуги(Услуга, Дата)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    СтоимостьУслуг.Стоимость КАК Стоимость
        |ИЗ
        |    РегистрСведений.СтоимостьУслуг.СрезПоследних(&Дата, Услуга = &Услуга) КАК СтоимостьУслуг";
    
    Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.УстановитьПараметр("Услуга", Услуга);
    
    Результат = Запрос.Выполнить().Выбрать();
    
    Если Результат.Следующий() Тогда
        Возврат Результат.Стоимость;
    Иначе
        Возврат 0;
    КонецЕсли;
    
КонецФункции

Процедура ПроверкаПродолжительности()
	Если ЗначениеЗаполнено(Объект.ДатаЗаезда) и ЗначениеЗаполнено(Объект.ДатаВыезда) Тогда	
		Если Объект.ДатаВыезда <= Объект.ДатаЗаезда Тогда
        
	        Сообщение = Новый СообщениеПользователю;
	        Сообщение.Текст = "Дата выезда должна быть позже даты заезда";
	        Сообщение.Поле = "Объект.ДатаВыезда";
	        Сообщение.Сообщить();
	        Объект.ДатаВыезда = Неопределено;  // сбросить некорректное значение
	        	Возврат;
		КонецЕсли;
		РазностьДат = Объект.ДатаВыезда - Объект.ДатаЗаезда;
		Продолжительность = Макс(РазностьДат, 0)/86400;
		Объект.ПродолжительностьПребывания = Продолжительность;
	Иначе
		Объект.ПродолжительностьПребывания = 0;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
	ПроверкаПродолжительности()
КонецПроцедуры

&НаКлиенте
Процедура БронируемыйНомерПриИзменении(Элемент)
	
	// Сбросим цену при очистке номера
	Если Объект.БронируемыйНомер = Неопределено Тогда
		Объект.Цена = 0;
		Возврат;
	КонецЕсли;
	Номер = Объект.БронируемыйНомер;
	Цена = ПолучитьАктуальнуюСтоимостьНомера(Номер);
	Объект.Цена = Цена;
КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальнуюСтоимостьНомера(Номер)
	Дата = ТекущаяДата();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьНомеровСрезПоследних.Стоимость КАК Стоимость,
	|	СтоимостьНомеровСрезПоследних.МаксимальноеКоличествоГостей КАК МаксимальноеКоличествоГостей
	|ИЗ
	|	РегистрСведений.СтоимостьНомеров.СрезПоследних КАК СтоимостьНомеровСрезПоследних
	|ГДЕ
	|	СтоимостьНомеровСрезПоследних.ТипНомера = &ТипНомера
	|	И СтоимостьНомеровСрезПоследних.МаксимальноеКоличествоГостей = &МаксимальноеКоличествоГостей";
	
	Запрос.УстановитьПараметр("ТипНомера", Номер.ТипНомера);
	Запрос.УстановитьПараметр("МаксимальноеКоличествоГостей", Номер.МаксимальноеКоличествоГостей);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Стоимость = Выборка.Стоимость;	
	Возврат Стоимость;
КонецФункции


//&НаКлиенте
//Процедура ПриОткрытии()    
 //   Элементы.ПродолжительностьПребывания.Доступность = Ложь;
 //   Элементы.ДатаВыезда.Доступность = Ложь;
// КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)    
	ПроверкаПродолжительности()
КонецПроцедуры