&НаКлиенте
Процедура БронируемыйНомерПриИзменении(Элемент)

	// Сбросим цену при очистке номера
	Если Элемент.БронируемыйНомер.Значение = Неопределено Тогда
		Элемент.ЦенаНомера.Значение = Неопределено;
		Возврат;
	КонецЕсли;

	// Получим текущий номер из формы
	Номер = Элементы.БронируемыйНомер.Значение;

	// Установим цену на основании данных из регистра
	УстановитьЦенуНомера(Номер);

КонецПроцедуры

&НаСервере
Функция ПолучитьАктуальнуюСтоимостьНомера(Номер, Дата = Неопределено)

	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СтоимостьНомеров.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьНомеров КАК СтоимостьНомеров
	|ГДЕ
	|	СтоимостьНомеров.ТипНомера = &ТипНомера
	|	И СтоимостьНомеров.Период <= &Дата
	|УПОРЯДОЧИТЬ ПО
	|	СтоимостьНомеров.Период УБЫВ
	|ОГРАНИЧИТЬ 1";

	Запрос.УстановитьПараметр("ТипНомера", Номер.ТипНомера);
	Запрос.УстановитьПараметр("Дата", Дата);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Стоимость;
	Иначе
		// Если нет актуальной цены, вернем 0 или можно сгенерировать исключение
		Возврат 0;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура УстановитьЦенуНомера(Номер)

	Цена = ПолучитьАктуальнуюСтоимостьНомера(Номер);
	Элементы.ЦенаНомера.Значение = Цена;

КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии()
    
    Элементы.ПродолжительностьПребывания.Доступность = Ложь;
    Элементы.ДатаВыезда.Доступность = Ложь;
    
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)
    
    Элементы.ПродолжительностьПребывания.Доступность = ЗначениеЗаполнено(Объект.ДатаЗаезда);
    Элементы.ДатаВыезда.Доступность = ЗначениеЗаполнено(Объект.ДатаЗаезда);
    
КонецПроцедуры