Процедура ОбработкаПроведения(Отказ,Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АрендаПомещенийСрезПоследних.Помещение,
	|	АрендаПомещенийСрезПоследних.ДатаАренды,
	|	АрендаПомещенийСрезПоследних.ВремяНачала,
	|	АрендаПомещенийСрезПоследних.ВремяОкончания
	|ИЗ
	|	РегистрСведений.АрендаПомещений.СрезПоследних(&Дата, ВремяОкончания > &ВремяНачала
	|	И ВремяНачала < &ВремяОкончания
	|	И ДатаАренды = &ДатаАренды И Помещение = &Помещение) КАК АрендаПомещенийСрезПоследних";
	

	
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("ДатаАренды", ДатаАренды);
	Запрос.УстановитьПараметр("ДатаАренды", ДатаАренды);
	Запрос.УстановитьПараметр("ВремяНачала", ВремяНачала);
	Запрос.УстановитьПараметр("ВремяОкончания", ВремяОкончания);
	Запрос.УстановитьПараметр("Дата", Дата);

	Результат = Запрос.Выполнить();
	ВыборкаПомещение = Результат.Выбрать();
	ВыборкаПомещение.Следующий();
	Если Не Результат.Пустой() Тогда
	    Сообщение = Новый СообщениеПользователю;
	    Сообщение.Текст = СтрШаблон(
	        "Помещение %1 занято с %2 по %3. Выберите другие даты, время или помещение.",
	        ВыборкаПомещение.Помещение,
	        Формат(ВыборкаПомещение.ВремяНачала, "ДЛФ=T;"),
	        Формат(ВыборкаПомещение.ВремяОкончания, "ДЛФ=T;")
	    );
	    Сообщение.Поле = "АрендаПомещений";
	    Сообщение.Сообщить();
	    Отказ = Истина;
	КонецЕсли;
	
	Если не Отказ Тогда	
		Движения.АрендаПомещений.Записывать = Истина;
		Движение = Движения.АрендаПомещений.Добавить();
		Движение.Период = Дата;
		Движение.ДатаАренды = ДатаАренды;
		Движение.Помещение = Помещение;
		Движение.ВремяНачала = ВремяНачала;
		Движение.ВремяОкончания = ВремяОкончания;
		Движение.Гость = Гость;
	КонецЕсли;
КонецПроцедуры